Config/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/Штрихкоды/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьПодключаемоеОборудование = Истина;
	
	Если Параметры.Свойство("СформироватьШтрихкодEAN13ПриОткрытии") Тогда
		Запись.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
		Запись.Штрихкод = ПолучитьНовыйШтрихкод();
	КонецЕсли;
	
	Если Параметры.Ключ.Пустой() Тогда
		Если ЗначениеЗаполнено(Запись.ИнвентарныйНомер) И Не ЗначениеЗаполнено(Запись.Объект) Тогда
			Запись.Объект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ИнвентарныйНомер, "ОС");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если Не ЗначениеЗаполнено(Запись.ИнвентарныйНомер) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ИнвентарныйНомер;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода"));
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	УправлениеОсновнымиСредствамиКлиент.СканированиеШтрихкода(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не УправлениеОсновнымиСредствамиКлиент.ЭтоКорректныйШтрихкод(Запись.Штрихкод, Запись.ТипШтрихкода) Тогда
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", "Штрихкод",,,
			НСтр("ru = 'Проверьте правильность заполнения штрихкода и его типа'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Запись.Штрихкод",, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТолькоПросмотр = Истина;
	
	Оповестить("ЗаписьШтрихКода", Новый Структура("Объект,ИнвентарныйНомер,ТипШтрихкода",
		Запись.Объект, Запись.ИнвентарныйНомер, Запись.ТипШтрихкода));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьШтрихкод(Команда)
	
	Запись.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	Запись.Штрихкод = ПолучитьНовыйШтрихкод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗначениеШтрихкода(ТекКод) Экспорт
	
	Если Не ТолькоПросмотр Тогда
		Запись.Штрихкод = ТекКод;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыйШтрихкод()
	
	Возврат РегистрыСведений.ШтрихКоды.СформироватьШтрихКодEAN13();
	
КонецФункции

#КонецОбласти
